package ru.suai;

import ru.suai.client.controller.ControllerClient;
import ru.suai.server.controller.ControllerServer;

/***********************************************************************************************************************
 *      Данный класс запускает серверную и клиентскую части многопользовательского приложения для рисования            *
 **********************************************************************************************************************/
public class App {
    public static void main(String[] args) {
        /***************************************************************************************************************
         * Для запуска сервера неоюходимо в качестве первого аргумента ввести [-S]                                     *
         * Для запуска клиентского приложения неоюходимо в качестве первого аргумента ввести [-C] [адрес] [порт]       *
         **************************************************************************************************************/
        if (args.length != 0) {
            if (args[0].toUpperCase().equals("-S")) {
                ControllerServer.mainServer();
            } else if (args[0].toUpperCase().equals("-C") && args.length == 3) {
                ControllerClient.mainClient(args[1], Integer.parseInt(args[2]));
            } else {
                System.out.println("[тип(-S/-S)] [адрес сервера(опционально)] [порт сервера(опционально)]");
            }
        } else {
            System.out.println("[тип(-S/-C)] [адрес сервера(опционально)] [порт сервера(опционально)]");
        }
    }
}